{
  "name": "LinterCopRuleset",
  "description": "These are the default rules of the linter cop. You can use this file as a template to start from",
  "rules": [
    {
      "id": "LC0001",
      "action": "Warning",
      "justification": "FlowFields should not be editable."
    },
    {
      "id": "LC0002",
      "action": "Warning",
      "justification": "Commit() needs a comment to justify its existence. Either a leading or a trailing comment."
    },
    {
      "id": "LC0003",
      "action": "Warning",
      "justification": "Do not use an Object ID for properties or variable declarations."
    },
    {
      "id": "LC0004",
      "action": "Warning",
      "justification": "DrillDownPageId and LookupPageId must be filled in table when table is used in list page."
    },
    {
      "id": "LC0005",
      "action": "Warning",
      "justification": "The casing of variable/method usage must align with the definition."
    },
    {
      "id": "LC0006",
      "action": "Error",
      "justification": "Fields with property AutoIncrement cannot be used in temporary table (TableType = Temporary)."
    },
    {
      "id": "LC0007",
      "action": "Hidden",
      "justification": "Every table needs to specify a value for the DataPerCompany property. Either true or false."
    },
    {
      "id": "LC0008",
      "action": "Warning",
      "justification": "Filter operators should not be used in SetRange"
    },
    {
      "id": "LC0009",
      "action": "Hidden",
      "justification": "Show info message about code metrics for each function or trigger."
    },
    {
      "id": "LC0010",
      "action": "Warning",
      "justification": "Show warning about code metrics for each function or trigger if either cyclomatic complexity is 8 or greater or maintainability index 20 or lower."
    },
    {
      "id": "LC0011",
      "action": "Hidden",
      "justification": "Every object needs to specify a value for the Access property. Either true or false. Optionally this can also be activated for table fields with the setting enableRule0011ForTableFields."
    },
    {
      "id": "LC0012",
      "action": "Warning",
      "justification": "Using hardcoded IDs in functions like Codeunit.Run() is not allowed."
    },
    {
      "id": "LC0013",
      "action": "Warning",
      "justification": "Any table with a single field in the PK of type code or text, should have set NotBlank on the PK field."
    },
    {
      "id": "LC0014",
      "action": "Warning",
      "justification": "The Caption of permissionset objects should not exceed the maximum length."
    },
    {
      "id": "LC0015",
      "action": "Warning",
      "justification": "All application objects should be covered by at least one permission set in the extension."
    },
    {
      "id": "LC0016",
      "action": "Warning",
      "justification": "Caption is missing. Optionally this can also be activated for fields on API objects with the setting enableRule0016ForApiObjects"
    },
    {
      "id": "LC0017",
      "action": "Warning",
      "justification": "Writing to a FlowField is not common. Add a comment to explain this."
    },
    {
      "id": "LC0018",
      "action": "Info",
      "justification": "Events in internal codeunits are not accessible to extensions and should therefore be avoided."
    },
    {
      "id": "LC0019",
      "action": "Info",
      "justification": "If Data Classification is set on the Table. Fields do not need the same classification."
    },
    {
      "id": "LC0020",
      "action": "Info",
      "justification": "If Application Area is set on the TablePage. Controls do not need the same classification."
    },
    {
      "id": "LC0021",
      "action": "Info",
      "justification": "Confirm() must be implemented through the Confirm Management codeunit from the System Application."
    },
    {
      "id": "LC0022",
      "action": "Info",
      "justification": "GlobalLanguage() must be implemented through the Translation Helper codeunit from the Base Application."
    },
    {
      "id": "LC0023",
      "action": "Info",
      "justification": "Always provide fieldsgroups DropDown and Brick on tables."
    },
    {
      "id": "LC0024",
      "action": "Info",
      "justification": "Procedure declaration should not end with semicolon."
    },
    {
      "id": "LC0025",
      "action": "Info",
      "justification": "Procedure must be either local or internal."
    },
    {
      "id": "LC0026",
      "action": "Info",
      "justification": "Guidelines for ToolTip text."
    },
    {
      "id": "LC0027",
      "action": "Info",
      "justification": "Utilize the Page Management codeunit for launching page."
    },
    {
      "id": "LC0028",
      "action": "Info",
      "justification": "Event subscriber arguments now use identifier syntax instead of string literals. Convert the argument literal to an identifier."
    },
    {
      "id": "LC0029",
      "action": "Info",
      "justification": "Use CompareDateTime method in Type Helper codeunit for DateTime variable comparisons."
    },
    {
      "id": "LC0030",
      "action": "Info",
      "justification": "Set Access property to Internal for Install/Upgrade codeunits."
    },
    {
      "id": "LC0031",
      "action": "Info",
      "justification": "Set ReadIsolation property instead of LockTable method."
    },
    {
      "id": "LC0032",
      "action": "Warning",
      "justification": "Clear(All) does not affect or change values for global variables in single instance codeunits."
    },
    {
      "id": "LC0033",
      "action": "Info",
      "justification": "The specified runtime version in app.json is falling behind."
    },
    {
      "id": "LC0034",
      "action": "Hidden",
      "justification": "The property Extensible should be explicitly set for public objects."
    },
    {
      "id": "LC0035",
      "action": "Info",
      "justification": "Explicitly set AllowInCustomizations for fields omitted on pages."
    }
  ]
}